""" 矩阵覆盖
我们可以用2^1的小矩形横着或者竖着去覆盖更大的矩形。
请问用n个2^1的小矩形无重叠地覆盖一个2*n的大矩形，总共有多少种方法？
"""

""" 依旧是斐波那契数列 
2*n的大矩形（两行n列），和n个2*1的小矩形（两行1列），其中target*2为大矩阵的大小 ，有以下几种情形： 

1.target <= 0 大矩形为<= 2*0,直接return 1； 

2.target = 1大矩形为2*1，只有一种摆放方法，return1； 

3.target = 2 大矩形为2*2，有两种摆放方法，return2； 

4.target = n 分为两步考虑： 

1）最后摆放的是一块 2 *1 的小矩阵，则摆放方法总共为f(target - 1)  
2）最后摆放的是一块1 *2的小矩阵，则摆放方法总共为f(target-2) 
因为，摆放了一块1*2的小矩阵，对应下方的1*2的位置的摆放方法也就确定了，所以为f(targte-2) 
"""

# 递归
def rectCover(self, n):
    re_list = [0, 1, 2]
    if n < 3:
        return re_list[n]
    n_2 = 1
    n_1 = 2
    n_cur = 0
    for i in range(3, n + 1):
        n_cur = n_2 + n_1
        n_2 = n_1
        n_1 = n_cur
    return n_cur
