# list / 列表，可修改

# 定义和初始化
a = [1, 2, 3, 4]
b = list([3, 4])
c = list(range(10))

# 取某个元素
a[1]
a[-1]   # 取最后一个元素

a[-2]   # 取倒数第二个元素

# 末尾 加 一个元素
# 注意下面这两个是不一样的
a.append(5)
a.append([5])

# 末尾 扩展一个列表
a.extend([6])
a.extend(b)

# 弹出
a.pop()     # 弹出尾部最后一个值
a.pop(0)    # 弹出第一个值

# 插入：第一个是位置，第二个是插的值
a.insert(2,10)

# 删除匹配的第一个值
a.remove(10)

# 切片
a[0:4]  # 包括 0123不包括4
a[2:]   # 2 到最后一个
a[:3]   # 第一个到2，不包括3


################
# tuple / 元组，不能修改的列表

# 定义
a = (1, 2, 3, 4)
b = tuple([1, 2, 3, 4])

# 把 list 转成 set
c = set([1, 3, 3, 4])

