"""
一只青蛙一次可以跳上1级台阶，也可以跳上2级。
求该青蛙跳上一个n级的台阶总共有多少种跳法。
"""

"""
本题思路：
对于本题,前提只有从之前一次跳1阶或者2阶跳到当前台阶的跳法。  
     a.假定上一次的位置在当前位置的下一阶，即上一次跳了一阶，那么到上一次的台阶的跳法是f(n-1);  
     b.假定上一次的位置在当前位置的下两阶，即上一次跳了两阶，那么到上一次的台阶的跳法是f(n-2); 
     c.由a\b假设可以得出总跳法为: f(n) = f(n-1) + f(n-2)   
     d.然后通过实际的情况可以得出：只有一阶的时候 f(1) = 1 ,只有两阶的时候可以有 f(2) = 2  
     e.可以发现最终得出的是一个斐波那契数列：  
  
                  | 1, (n=1)  
     f(n) =       | 2, (n=2)  
                  | f(n-1)+f(n-2) ,(n>2,n为整数)
"""


# -*- coding:utf-8 -*-
class Solution:
    def jumpFloor(self, number):
        re_list = [0, 1, 2]
        if n < 3:
            return re_list[n]
        n_2 = 1
        n_1 = 2
        n_cur = 0
        for i in range(3, n + 1):
            n_cur = n_2 + n_1
            n_2 = n_1
            n_1 = n_cur
        return n_cur
